#====================================================================

# チェスのCPU（greed法）

#====================================================================
import random
class CpuControlGreed:
    # ==================================
    # コンストラクタ
    # ==================================
    def __init__(self, move_calculator, check_game_end):
        """
        引数：
            move_calculator, 移動先セル計算用クラス
            check_game_end, チェックメイトの判定用クラス
        """
        self.evaliate_piece = {
            "pawn"  : 10,
            "knight": 30,   
            "bishop": 30,   
            "rook"  : 50,   
            "queen" : 100,  
            "king"  : 10000 
        }
        self.evaliate_board = {
            "pawn": {
                "opening": [
                    [ 0,  0,  0,  0,  0,  0,  0,  0],
                    [50, 50, 50, 50, 50, 50, 50, 50],
                    [ 5, 10, 10,-20,-20, 10, 10,  5],
                    [10, 10, 20, 30, 30, 20, 10, 10],
                    [ 5,  5, 10, 25, 25, 10,  5,  5],
                    [ 0,  0,  0, 20, 20,  0,  0,  0],
                    [ 5, -5,-10,  0,  0,-10, -5,  5],
                    [ 0,  0,  0,  0,  0,  0,  0,  0]
                ],
                "midgame": [
                    [90, 90, 90, 90, 90, 90, 90, 90],
                    [60, 60, 60, 60, 60, 60, 60, 60],
                    [20, 20, 30, 40, 40, 30, 20, 20],
                    [10, 10, 20, 35, 35, 20, 10, 10],
                    [ 5,  5, 10, 30, 30, 10,  5,  5],
                    [10,  5,  0, 10, 10,  0,  5, 10],
                    [10, 15, 15, -10,-10, 15, 15, 10],
                    [ 0,  0,  0,  0,  0,  0,  0,  0]
                ],
                "endgame": [
                    [100, 100, 100, 100, 100, 100, 100, 100],
                    [90, 90, 90, 90, 90, 90, 90, 90],
                    [70, 70, 70, 70, 70, 70, 70, 70],
                    [50, 50, 50, 50, 50, 50, 50, 50],
                    [30, 30, 30, 30, 30, 30, 30, 30],
                    [10, 10, 10, 10, 10, 10, 10, 10],
                    [ 0,  0,  0,  0,  0,  0,  0,  0],
                    [ 0,  0,  0,  0,  0,  0,  0,  0]
                ]
            },
            "knight": {
                "opening": [
                    [-50,-40,-30,-30,-30,-30,-40,-50],
                    [-40,-20,  0,  0,  0,  0,-20,-40],
                    [-30,  0, 10, 15, 15, 10,  0,-30],
                    [-30,  5, 15, 20, 20, 15,  5,-30],
                    [-30,  0, 15, 20, 20, 15,  0,-30],
                    [-30,  5, 10, 15, 15, 10,  5,-30],
                    [-40,-20,  0,  5,  5,  0,-20,-40],
                    [-50,-40,-30,-30,-30,-30,-40,-50]
                ],
                "midgame": [
                    [-50,-40,-30,-30,-30,-30,-40,-50],
                    [-40,-20,  0,  5,  5,  0,-20,-40],
                    [-30,  5, 10, 15, 15, 10,  5,-30],
                    [-30, 10, 15, 20, 20, 15, 10,-30],
                    [-30,  5, 15, 20, 20, 15,  5,-30],
                    [-30,  0, 10, 15, 15, 10,  0,-30],
                    [-40,-20,  0,  0,  0,  0,-20,-40],
                    [-50,-40,-30,-30,-30,-30,-40,-50]
                ],
                "endgame": [
                    [-50,-30,-20,-20,-20,-20,-30,-50],
                    [-30,-10,  0,  5,  5,  0,-10,-30],
                    [-20,  0, 10, 10, 10, 10,  0,-20],
                    [-20,  5, 10, 15, 15, 10,  5,-20],
                    [-20,  5, 10, 15, 15, 10,  5,-20],
                    [-20,  0, 10, 10, 10, 10,  0,-20],
                    [-30,-10,  0,  5,  5,  0,-10,-30],
                    [-50,-30,-20,-20,-20,-20,-30,-50]
                ]
            },
            "bishop": {
                "opening": [
                    [-20,-10,-10,-10,-10,-10,-10,-20],
                    [-10,  0,  0,  0,  0,  0,  0,-10],
                    [-10,  0,  5, 10, 10,  5,  0,-10],
                    [-10,  5,  5, 10, 10,  5,  5,-10],
                    [-10,  0, 10, 10, 10, 10,  0,-10],
                    [-10, 10, 10, 10, 10, 10, 10,-10],
                    [-10,  5,  0,  0,  0,  0,  5,-10],
                    [-20,-10,-10,-10,-10,-10,-10,-20]
                ],
                "midgame": [
                    [-20,-10,-10,-10,-10,-10,-10,-20],
                    [-10,  5,  0,  0,  0,  0,  5,-10],
                    [-10, 10,  5, 10, 10,  5, 10,-10],
                    [-10,  5,  5, 10, 10,  5,  5,-10],
                    [-10,  0, 10, 10, 10, 10,  0,-10],
                    [-10,  5, 10, 10, 10, 10,  5,-10],
                    [-10,  0,  0,  0,  0,  0,  0,-10],
                    [-20,-10,-10,-10,-10,-10,-10,-20]
                ],
                "endgame": [
                    [-20,-10,-10,-10,-10,-10,-10,-20],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [-10,  5, 10, 10, 10, 10,  5,-10],
                    [-10,  5, 10, 15, 15, 10,  5,-10],
                    [-10,  5, 10, 15, 15, 10,  5,-10],
                    [-10,  5, 10, 10, 10, 10,  5,-10],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [-20,-10,-10,-10,-10,-10,-10,-20]
                ]
            },
            "rook": {
                "opening": [
                    [  0,  0,  0,  0,  0,  0,  0,  0],
                    [  5, 10, 10, 10, 10, 10, 10,  5],
                    [ -5,  0,  0,  0,  0,  0,  0, -5],
                    [ -5,  0,  0,  0,  0,  0,  0, -5],
                    [ -5,  0,  0,  0,  0,  0,  0, -5],
                    [ -5,  0,  0,  0,  0,  0,  0, -5],
                    [ -5,  0,  0,  0,  0,  0,  0, -5],
                    [  0,  0,  0,  5,  5,  0,  0,  0]
                ],
                "midgame": [
                    [  0,  0,  5, 10, 10,  5,  0,  0],
                    [ 10, 15, 15, 15, 15, 15, 15, 10],
                    [ -5,  0,  0,  5,  5,  0,  0, -5],
                    [ -5,  0,  0,  5,  5,  0,  0, -5],
                    [ -5,  0,  0,  5,  5,  0,  0, -5],
                    [ -5,  0,  0,  5,  5,  0,  0, -5],
                    [ -5,  0,  0,  5,  5,  0,  0, -5],
                    [  0,  0,  5, 10, 10,  5,  0,  0]
                ],
                "endgame": [
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 20, 25, 25, 25, 25, 25, 25, 20],
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 10, 10, 10, 10, 10, 10, 10, 10],
                    [ 10, 10, 10, 10, 10, 10, 10, 10]
                ]
            },
            "queen": {
                "opening": [
                    [-20,-10,-10, -5, -5,-10,-10,-20],
                    [-10,  0,  0,  0,  0,  0,  0,-10],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [ -5,  0,  5,  5,  5,  5,  0, -5],
                    [  0,  0,  5,  5,  5,  5,  0, -5],
                    [-10,  5,  5,  5,  5,  5,  0,-10],
                    [-10,  0,  5,  0,  0,  0,  0,-10],
                    [-20,-10,-10, -5, -5,-10,-10,-20]
                ],
                "midgame": [
                    [-20,-10,-10, -5, -5,-10,-10,-20],
                    [-10,  0,  0,  5,  5,  0,  0,-10],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [ -5,  5,  5,  5,  5,  5,  0, -5],
                    [  0,  5,  5,  5,  5,  5,  0, -5],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [-10,  0,  0,  0,  0,  0,  0,-10],
                    [-20,-10,-10, -5, -5,-10,-10,-20]
                ],
                "endgame": [
                    [-20,-10,-10, -5, -5,-10,-10,-20],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [-10,  5,  5, 10, 10,  5,  5,-10],
                    [ -5,  5, 10, 10, 10, 10,  5, -5],
                    [ -5,  5, 10, 10, 10, 10,  5, -5],
                    [-10,  5,  5, 10, 10,  5,  5,-10],
                    [-10,  0,  5,  5,  5,  5,  0,-10],
                    [-20,-10,-10, -5, -5,-10,-10,-20]
                ]
            },
            "king": {
                "opening": [
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-20,-30,-30,-40,-40,-30,-30,-20],
                    [-10,-20,-20,-20,-20,-20,-20,-10],
                    [ 20, 20,  0,  0,  0,  0, 20, 20],
                    [ 20, 30, 10,  0,  0, 10, 30, 20]
                ],
                "midgame": [
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-30,-40,-40,-50,-50,-40,-40,-30],
                    [-20,-30,-30,-40,-40,-30,-30,-20],
                    [-10,-20,-20,-20,-20,-20,-20,-10],
                    [ 20, 20,  0,  0,  0,  0, 20, 20],
                    [ 20, 30, 10,  0,  0, 10, 30, 20]
                ],
                "endgame": [
                    [-50,-40,-30,-20,-20,-30,-40,-50],
                    [-30,-20,-10,  0,  0,-10,-20,-30],
                    [-30,-10, 20, 30, 30, 20,-10,-30],
                    [-30,-10, 30, 40, 40, 30,-10,-30],
                    [-30,-10, 30, 40, 40, 30,-10,-30],
                    [-30,-10, 20, 30, 30, 20,-10,-30],
                    [-30,-30,  0,  0,  0,  0,-30,-30],
                    [-50,-30,-30,-30,-30,-30,-30,-50]
                ]
            }
        }

        # 移動先計算用クラス
        self.move_calculator = move_calculator
        # 移動先計算用クラス
        self.check_game_end  = check_game_end

    # ==================================
    # メソッド
    # ==================================
    def create_tmp_board(self, curr_board, turn, moved_pieces, prev_log, game_log):
        """
        すべての駒が動きうる盤面を一時的に作り、その盤面をそれぞれ得点計算する
        一番得点が大きくなる盤面になるように駒を動かす
        引数：
            curr_board, 現在の盤面
            turn, ターン（黒ターンがAIターン）
            moved_pieces, 動いた駒のログ
            prev_log, 一手前のログ
            game_log, ゲーム全体のログ
        戻り値：
            max_score_info, cpuの動作['駒', (出発Y, 出発X), (行先Y, 行先X)]
        """
        # 黒ターンのみ実行
        if (turn): return

        # 生きている駒の座標を取る
        black_piece_list = []
        white_piece_list = []
        for row in range(0, 8):
            for col in range(0, 8):
                piece = curr_board[row][col]
                if (piece != 0) and (piece[0] == "b"):
                    black_piece_list.append([piece, (row, col)])
                elif (piece != 0) and (piece[0] == "w"):
                    white_piece_list.append([piece, (row, col)])

        # 一番大きい得点が大きくなる駒とその移動先を保持
        max_score_info = None
        max_score = -99999
        score = 0

        # 駒ごとに移動可能先を求める
        for info in black_piece_list:
            if info[0][1] == "P":
                fromY, fromX = info[1]
                mobiles = self.move_calculator.calc_pawn_moves(curr_board, fromY, fromX, prev_log, turn)
            else:
                fromY, fromX = info[1]
                mobiles = self.move_calculator.calc_common_moves(curr_board, fromY, fromX, info[0], turn, moved_pieces)

            # 動かせるすべてのセルから「チェックにならない」「チェックを解除できる手」だけを抽出する
            safe_mobiles = []
            for destY, destX in mobiles:
                tmp_board = [row[:] for row in curr_board]
                tmp_board[fromY][fromX] = 0
                tmp_board[destY][destX] = info[0]
                # この一手でチェック状態にならないなら、安全な手リストに追加
                if not self.check_game_end.is_check(tmp_board, turn):
                    safe_mobiles.append((destY, destX))
            
            # 仮盤面上にすべての移動先に移動させ、得点を計算
            for destY, destX in safe_mobiles:
                tmp_board = [row[:] for row in curr_board]
                tmp_board[fromY][fromX] = 0
                tmp_board[destY][destX] = info[0]
                score = self.calc_board_score(tmp_board, black_piece_list, white_piece_list, game_log)

                # 計算後、一番大きい得点が大きくなる駒とその移動先を保持
                # 得点が同じ場合は、どちらかをランダムで残す
                if score == max_score:
                    rand = random.randint(0, 1)
                    if (rand == 0):
                        max_score_info = [info[0], (fromY, fromX), (destY, destX)]
                        max_score = score
                elif score > max_score:
                    max_score_info = [info[0], (fromY, fromX), (destY, destX)]
                    max_score = score

        # max_score_info が None のまま（＝チェックメイト）の場合のエラーを避ける
        if max_score_info is None:
            return ["xX", (0, 0), (0,0)]
        
        return max_score_info
        

    def calc_board_score(self, tmp_board, b_piece_list, w_piece_list, game_log):
        """
        クラス変数のマスによる得点と、自分の駒の得点で得点計算を行う
        （駒がたっているマスの得点＋駒の得点を自陣の駒すべてに行い、それの和）
        引数：
            tmp_board, 駒を移動させた際の仮想盤
            b_piece_list, 生きている黒駒と座標のリスト
            w_piece_list, 生きている白駒と座標のリスト
            game_log, ゲーム全体のログ
        返り値：
            score, 計算後の得点
        """
        # 現状が序盤中盤終盤のどれなのかを判断するために必要な情報を取得する
        # 経過ターン数の取得（両手番が終わると１ターン経過）
        game_turn = (len(game_log) // 2) + 1
        # お互いの生存駒の数
        black_cnt = len(b_piece_list)
        white_cnt = len(w_piece_list)
        # お互いクイーンが存在するか
        b_queen = False
        w_queen = False
        for data in b_piece_list:
            if data[0] == "bQ":
                b_queen = True
                break
        for data in w_piece_list:
            if data[0] == "wQ":
                w_queen = True
                break

        # 10ターン以下は序盤
        # お互いのクイーンが存在しないかつ駒の合計数が16個以下もしくは30ターン以降終盤
        # どちらでもないときは中盤
        if game_turn <= 10:
            game_status = "opening"
        elif ((not b_queen and not w_queen) and (black_cnt + white_cnt <= 16)) or (30 < game_turn):
            game_status = "endgame"
        else:
            game_status = "midgame"

        # ゲーム状況によって計算用配列を変えてスコアを計算
        score = 0
        for y in range(8):
            for x in range(8):
                piece = tmp_board[y][x]
                # 駒がないならcontinue
                if piece == 0:
                    continue

                # 黒駒の場合スコア計算
                if piece[0] == "b":
                    evY = 7 - y
                    evX = 7 - x

                if (piece == "bP"):
                    score += (self.evaliate_piece["pawn"]   + self.evaliate_board["pawn"][game_status][evY][evX])
                elif (piece == "bN"):
                    score += (self.evaliate_piece["knight"] + self.evaliate_board["knight"][game_status][evY][evX])
                elif (piece == "bB"):
                    score += (self.evaliate_piece["bishop"] + self.evaliate_board["bishop"][game_status][evY][evX])
                elif (piece == "bR"):
                    score += (self.evaliate_piece["rook"]   + self.evaliate_board["rook"][game_status][evY][evX])
                elif (piece == "bQ"):
                    score += (self.evaliate_piece["queen"]  + self.evaliate_board["queen"][game_status][evY][evX])
                elif (piece == "bK"):
                    score += (self.evaliate_piece["king"]   + self.evaliate_board["king"][game_status][evY][evX])
        
        return score